OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/0.org/baffle3DRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    bottom
    {
        type                compressible::thermalBaffle;
        kappa               solidThermo;
        kappaName           none;
        value               uniform 300;
    }
    side
    {
        type                zeroGradient;
    }
    top
    {
        type                compressible::thermalBaffle;
        kappa               solidThermo;
        kappaName           none;
        value               uniform 300;
    }
}


// ************************************************************************* //
